"""item"""
#ผ่าน 5 ชั้น stat อาวุธ จะเพิ่มขึ้น 5 stat
import random   
"""item in game Ultimate tower super ultra Character Galaxy of god"""
rate_drop = ["แย่", "งั้นๆ", "งั้นๆ", "งั้นๆ", "งั้นๆ", "งั้นๆ", "ดีเยี่ยม", "ดีเยี่ยม", "ดีเยี่ยม", "ตำนานจนละเอียด"]
#ถ้ามีเวลาค่อยใส่ของกวนๆ
potion_drop = ["Potion HP", "Potion MP"]
legen_drop = ["กิ้งไม้แห่งสัจธรรม", "สว่านทะลวงสวรรค์"]
weapon_drop = ["ดาบ", "เรเปีย", "สมุดเวทย์", "หอก", "ดาบยักษ์", "ดาบสามมือ", "คฑาเวทย์", "ตะเกียงเวทย์", "ไม้กายสิทธิ์", "ระเบิดเวทย์"]

weapon_legendary = {"กิ้งไม้แห่งสัจธรรม":{"str": 0, "int": 1000, "agi": 20, "skill":{"ความจริงมีเพียงหนึ่งเดียว!": {}}}, 
                    "สว่านทะลวงสวรรค์":{"str": 0, "int": 1000, "agi": 20, "skill":{"บุกทะลวงเข้าไป!": {}}}}
weapon = {"ดาบ": {"str": 5, "int": 0, "agi": 3, "skill": {"ฟันตรง": (4,0), "ดาบเฉือนลม": (10,0), "ฟันแหลก": (,0), "ดาบสั่งตายใจสั่งมา": (,0)}}, 
              "หอก": {"str": 6, "int": 0, "agi": 4, "skill": {"แทงตรง": (4,0), "ทะลวงเข้าไป!": (13,0), "ควงสว่าน": (,0), "เฮลิปเตอร์!": (,0)}}, 
              "เรเปีย": {"str": 3, "int": 0, "agi": 9, "skill": {"ยก": (2,0), "ชิด": (10,0), "จ้วง": (,0), "แทง!": (,0)}},
              "ดาบยักษ์": {"str": 10, "int": 0, "agi": -1, "skill": {"ฟันตรงแบบแรง!": (6,0), "ตบลอย": (18,0), "ถล่มพสุธา": (,0), "ผ่าปฐพี": (,0)}}, 
              "ดาบสามมือ": {"str": 8, "int": 0, "agi": 5, "skill": {"ฟันสามต่อ": (5,0), "ตัดผ่าอากาศสามต่อ": (15,0), "อาชูรา": (,0), "เพลงดาบสายลม 36 ประกาศ": (,0)}}, 
              "สมุดเวทย์": {"str": 0, "int": 5, "agi": 3, "skill": {"ลูกบอลไฟ": (3,), "สายฟ้าฝาด": (,), "เกมลงทัณฑ์แห่งความมืด": (,), "อ่านหนังสือซะบ้างเซ่!": (,)}}, 
              "คฑาเวทย์": {"str": 0, "int": 10, "agi": -1, "skill": {"คฑาเสริมเวทย์ฟาดไม่ยั้ง": (4,), "ลมเฉือน": (,), "ไปคุยกับรากมะม่วง!": (,), "ตัวแทนแห่งดวงจันทร์จะลงทัณฑ์แกเอง": (,)}}, 
              "ตะเกียงเวทย์": {"str": 0, "int": 7, "agi": 1, "skill": {"เวทแห่งแสง": (3,), "พาาาลังงงคลื่นนเต่าาาา!": (,), "ดาบผนึกแห่งแสง": (,), "บอลเกงกิ": (,)}}, 
              "ไม้กายสิทธิ์": {"str": 0, "int": 6, "agi": 7, "skill": {"สติลไวไฟ": (4,), "ร้ายกาจจจ": (,), "เอสเปรสโซ่ปลาโตนุ่ม": (,), "อะวาเคดาบร้า": (,)}}, 
              "ระเบิดเวทย์": {"str": 0, "int": 8, "agi": 5, "skill": {"ประทัด": (2,), "ระเบิดมือ": (,), "ทีเอ็นที": (,), "ระเบิดเวลาอ๊ากกกกกก!": (,)}}}

def re_item():
    """rate drop item"""
    random_rate = random.choice(rate_drop)
    random_drop = random.choice(weapon_drop)
    gain = weapon[random_drop]
    if random_rate == "แย่":
        gain["str"] += -1
        gain["int"] += -1
        gain["agi"] += -1
    if random_rate == "ดีเยี่ยม":
        gain["str"] += 5
        gain["int"] += 5
        gain["agi"] += 5
    if random_rate == "ดีเยี่ยม":
        gain["str"] *= 2
        gain["int"] *= 2
        gain["agi"] *= 2
    return gain
def rate_legend():
    """rate drop legendary waepon"""
    if random.randrange(10) == random.randrange(10):
        legend = random.choice(legen_drop)
        return legend