"""tutorial"""
#ไม่ใช้แล้ว มันบัคคคคคคคคคคคคคคคคคคคคคคคคคคคคคคคคคค
def tutorial(level, weapon, name):
    """hello newbie"""
    print("[พระเจ้า]: \"ฮึ่มม... แปลกจริงนะข้ารับรู้ได้ถึงพลังที่แข็งแกร่ง แต่เจ้าหาใช่ผู้ย้อนกลับงั้นรึ ถ้าอย่างงั้นข้าจะสอนเจ้าเองนี้เพราะข้าเห็นว่าเจ้ามีแววหรอกนะ\"")
    print("ขณะนี้คุณได้เข้ามสู่ชั้น 1")
    print("พระเจ้า: \"เอาล่ะจ้าได้เข้าสู่ชั้นแรกแล้วลองไปสู้กับมอนนั้นเพื่อทะยานไปชั้นต่อไปเลย!!!\"")
    while level < 5:
        if level == 1:
            print("""คุณได้พบมอนในพุ่มหญ้า นั้นก็ คือ สไลม์้อยน่ารัก
ท่านจะทำอะไรดี?
1 ลองเข้าไปลูบ 2 แจ้งตำรวจ 3 โทรหาแม่ 4 สวดมนต์""")
            choice = input()
            while True:
                if choice in [1, 2 ,3, 4]:
                    break
                else:
                    print("เฮ้ นั้นทำไม่ได้นะ")
            print("""สไลม์น้อย ใช้ท่าอัดกระแทกกก!
[พระเจ้า] : \"เดี๋ยวๆๆๆๆๆๆ นี้เจ้าตั้งใจจริงปะเนี่ย รอบหน้าเอาให้จริงขังหน่อยเซ่!\"
ท่านจะทำอะไรดี?
1 2 3 4 """)
        level += 1
        